INSERT INTO Ingredients (title)
VALUES
('Мясо говядины'),
('Мясо курицы'),
('Рыба'),
('Помидоры'),
('Огурцы'),
('Перец болгарский'),
('Лук'),
('Чеснок'),
('Картофель'),
('Морковь'),
('Сахар'),
('Мука'),
('Рис'),
('Соль'),
('Перец'),
('Масло растительное'),
('Масло оливковое'),
('Сметана'),
('Сыр'),
('Молоко'),
('Сливки'),
('Яйца'),
('Зелень'),
('Грибы'),
('Специи'),
('Уксус'),
('Сода'),
('Майонез'),
('Кетчуп'),
('Горчица'),
('Соевый соус'),
('Маслины'),
('Лимон'),
('Мед'),
('Сухие фрукты'),
('Орехи'),
('Шоколад'),
('Какао порошок'),
('Кофе'),
('Чай'),
('Вода'),
('Сок'),
('Вино'),
('Пиво'),
('Апельсины'),
('Яблоки'),
('Груши'),
('Вишня'),
('Ананасы'),
('Клубника'),
('Малина'),
('Абрикосы'),
('Персики'),
('Арбуз'),
('Дыня'),
('Киви'),
('Бананы'),
('Мандарины'),
('Грейпфруты'),
('Лайм'),
('Мята'),
('Кинза'),
('Петрушка'),
('Розмарин'),
('Тимьян'),
('Базилик'),
('Кориандр'),
('Имбирь'),
('Куркума'),
('Корица'),
('Ваниль'),
('Карри'),
('Паприка'),
('Хрен'),
('Тмин'),
('Марсала'),
('Бренди'),
('Кальвадос'),
('Виски'),
('Текила'),
('Ром'),
('Водка'),
('Шампанское'),
('Коньяк'),
('Ликер'),
('Вермут'),
('Кока-кола'),
('Пепси-кола'),
('Спрайт'),
('Фанта'),
('Сока'),
('Лимонад'),
('Лук-порей'),
('Сельдерей'),
('Перец чили'),
('Корень имбиря'),
('Лимонная трава'),
('Кокосовое молоко'),
('Кунжутное масло'),
('Лавровый лист'),
('Редис'),
('Фасоль'),
('Чечевица'),
('Баклажаны'),
('Спаржа'),
('Шпинат'),
('Капуста'),
('Брокколи'),
('Цукини'),
('Кабачок'),
('Белокочанная капуста'),
('Щавель'),
('Руккола'),
('Морская капуста'),
('Консервированные помидоры'),
('Артишоки'),
('Оливки'),
('Каперсы'),
('Лимонный сок'),
('Лаймовый сок'),
('Грейпфрутовый сок'),
('Апельсиновый сок'),
('Ананасовый сок'),
('Вишневый сок'),
('Яблочный сок'),
('Гранатовый сок'),
('Малиновый сок'),
('Персиковый сок'),
('Грушевый сок'),
('Черничный сок'),
('Морковный сок'),
('Томатный сок'),
('Гранатовый сироп'),
('Розовый сироп'),
('Мятный сироп'),
('Френч-ванильный сироп'),
('Карамельный сироп'),
('Имбирный сироп'),
('Апельсиновый сироп'),
('Лимонный сироп'),
('Малиновый сироп'),
('Вишневый сироп'),
('Кокосовый сироп'),
('Масло кунжутное'),
('Масло арахисовое'),
('Масло из виноградных косточек'),
('Масло авокадо'),
('Масло грецкого ореха'),
('Масло миндаля'),
('Масло льняное'),
('Масло тыквенное'),
('Масло ореха макадамии'),
('Масло кедрового ореха'),
('Масло кешью'),
('Масло маковое'),
('Масло подсолнечное'),
('Масло кокосовое'),
('Масло пальмовое'),
('Масло рапсовое'),
('Масло соевое'),
('Масло оливковое extra virgin'),
('Масло оливковое рафинированное'),
('Масло оливковое грубого отжима'),
('Масло кукурузное'),
('Курица'),
('Свинина'),
('Говядина'),
('Лосось'),
('Индейка'),
('Свекла'),
('Томаты'), 
('Кабачки'),
('Цветная капуста'), 
('Салатный лист'),
('Редька'), 
('Укроп'),
('Салат Романо'), 
('Латук'), 
('Брюссельская капуста'),
('Картофель сладкий'), 
('Морковь цветная'), 
('Тыква'), 
('Кабачки цветные'), 
('Баклажаны цветные'), 
('Черри'), 
('Томаты желтые'), 
('Томаты черри'),
('Томаты груша'), 
('Томаты черного цвета'), 
('Томаты кумато'), 
('Брокколетти'), 
('Мини кабачки'), 
('Мини перцы'),
('Пекинская капуста'),
('Картофель новый'),
('Колбаса');

INSERT INTO dishes (title) VALUES
('Борщ'),
('Куриный суп'),
('Салат "Цезарь"'),
('Пицца'),
('Свиной шницель'),
('Лосось в кляре'),
('Оливье'),
('Пельмени'),
('Паста карбонара'),
('Шашлык'),
('Картофель фри'),
('Свинина по-корейски'),
('Суши'),
('Жареный рис с овощами'),
('Картофельное пюре'),
('Гречневая каша'),
('Салат "Греческий"'),
('Бифштекс'),
('Гуляш'),
('Куриные крылья'),
('Суп-лапша'),
('Курица в духовке'),
('Фаршированный перец'),
('Рататуй'),
('Телячья вырезка'),
('Свиной рулет'),
('Томатный суп'),
('Гренки'),
('Томаты с моцареллой'),
('Мидии'),
('Свиной бекон'),
('Булгур'),
('Шницель из индейки'),
('Запеченная форель'),
('Картофельные дольки'),
('Кукурузные хлопья'),
('Томатный салат'),
('Кукурузная каша'),
('Рагу из креветок'),
('Креветки на гриле'),
('Свиные ребра'),
('Фрикадельки'),
('Бутерброд с сыром'),
('Консоме'),
('Томатный суп с рисом'),
('Спагетти с мидиями'),
('Суп-пюре'),
('Сэндвич с тунцом');


-- Борщ (1)
INSERT INTO Dishes_Ingredients (dish_id, ingredient_id) VALUES
(1, 1), -- Мясо говядины
(1, 4), -- Помидоры
(1, 5), -- Огурцы
(1, 7), -- Лук
(1, 8), -- Чеснок
(1, 9); -- Картофель

-- Куриный суп (2)
INSERT INTO Dishes_Ingredients (dish_id, ingredient_id) VALUES
(2, 2), -- Мясо курицы
(2, 4), -- Помидоры
(2, 5), -- Огурцы
(2, 7), -- Лук
(2, 9); -- Картофель

-- Салат "Цезарь" (3)
INSERT INTO Dishes_Ingredients (dish_id, ingredient_id) VALUES
(3, 2), -- Мясо курицы
(3, 5), -- Огурцы
(3, 7), -- Лук
(3, 23); -- Зелень

-- Пицца (4)
INSERT INTO Dishes_Ingredients (dish_id, ingredient_id) VALUES
(4, 12), -- Мука
(4, 19), -- Сыр
(4, 28); -- Майонез

-- Свиной шницель (5)
INSERT INTO Dishes_Ingredients (dish_id, ingredient_id) VALUES
(5, 3), -- Рыба
(5, 6), -- Перец болгарский
(5, 7), -- Лук
(5, 10); -- Морковь

-- Лосось в кляре (6)
INSERT INTO Dishes_Ingredients (dish_id, ingredient_id) VALUES
(6, 3), -- Рыба
(6, 13), -- Рис
(6, 14); -- Соль

-- Оливье (7)
INSERT INTO Dishes_Ingredients (dish_id, ingredient_id) VALUES
(7, 2), -- Мясо курицы
(7, 5), -- Огурцы
(7, 7), -- Лук
(7, 9); -- Картофель

-- Пельмени (8)
INSERT INTO Dishes_Ingredients (dish_id, ingredient_id) VALUES
(8, 3), -- Рыба
(8, 6), -- Перец болгарский
(8, 7), -- Лук
(8, 12); -- Мука

-- Паста карбонара (9)
INSERT INTO Dishes_Ingredients (dish_id, ingredient_id) VALUES
(9, 12), -- Мука
(9, 22), -- Яйца
(9, 27), -- Уксус
(9, 29); -- Кетчуп

-- Шашлык (10)
INSERT INTO Dishes_Ingredients (dish_id, ingredient_id) VALUES
(10, 1), -- Мясо говядины
(10, 3), -- Рыба
(10, 5), -- Огурцы
(10, 8), -- Чеснок
(10, 10); -- Морковь


















